Revit 2026 API

# ElementNode Properties

---

The ElementNode type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Document | Gets the document associated with the element. |
|  | ElementId | The Id of the element. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from RenderNode) |
|  | LinkInstanceId | The Id of the link instance for the element. |
|  | NodeName | A readable name of the output node. (Inherited from RenderNode) |

#### Reference

ElementNode Class

Autodesk.Revit.DB Namespace